
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/goda6565/lambda-bot/actions/runs/15225619145)



<pre><code>Apply complete! Resources: 4 added, 1 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.lambda.data.aws_iam_policy_document.lambda_policy_document: Reading...
module.lambda.aws_cloudwatch_log_group.lambda: Refreshing state... [id=/aws/lambda/lambda-bot-prod]
module.api_gateway.aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=/aws/lambda/lambda-bot-prod-api-gateway]
module.ecr.aws_ecr_repository.ecr_repository: Refreshing state... [id=lambda-bot-prod]
module.api_gateway.aws_apigatewayv2_api.lambda_api: Refreshing state... [id=0pdgg6nqu1]
module.lambda.data.aws_iam_policy_document.lambda_policy_document: Read complete after 0s [id=2690255455]
module.lambda.aws_iam_role.lambda_role: Refreshing state... [id=lambda-bot-prod-role]
module.lambda.aws_iam_role_policy_attachment.lambda_role_policy_attachment: Refreshing state... [id=lambda-bot-prod-role-20250524055713202500000001]
module.lambda.aws_iam_role_policy.lambda_secret_manager_policy: Refreshing state... [id=lambda-bot-prod-role:lambda-bot-prod-secret-manager-policy]
module.api_gateway.aws_apigatewayv2_stage.lambda_function_invoke_stage: Refreshing state... [id=$default]
module.lambda.aws_lambda_function.lambda: Refreshing state... [id=lambda-bot-prod]
module.lambda.aws_lambda_alias.lambda: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:061051222129:function:lambda-bot-prod:prod]
module.api_gateway.aws_lambda_permission.allow_apigateway: Refreshing state... [id=AllowInvokeFromApiGateway]
module.api_gateway.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=vfdjtep]
module.api_gateway.aws_apigatewayv2_route.lambda_function_route: Refreshing state... [id=n414fla]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda.data.aws_iam_policy_document.lambda_secret_manager_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_secret_manager_policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.lambda.aws_iam_role_policy.lambda_secret_manager_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "lambda_secret_manager_policy" {
        id          = "lambda-bot-prod-role:lambda-bot-prod-secret-manager-policy"
        name        = "lambda-bot-prod-secret-manager-policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3",
                          - "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret will be created
  + resource "aws_secretsmanager_secret" "secretsmanager_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "slack-bot-token-prod"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # module.slack_bot_token.aws_secretsmanager_secret_version.secretmanager_secret_version will be created
  + resource "aws_secretsmanager_secret_version" "secretmanager_secret_version" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret will be created
  + resource "aws_secretsmanager_secret" "secretsmanager_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "slack-signing-secret-prod"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # module.slack_signing_secret.aws_secretsmanager_secret_version.secretmanager_secret_version will be created
  + resource "aws_secretsmanager_secret_version" "secretmanager_secret_version" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.
module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret: Creating...
module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret: Creating...
module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret: Creation complete after 1s [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-prod-UoovR7]
module.slack_bot_token.aws_secretsmanager_secret_version.secretmanager_secret_version: Creating...
module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret: Creation complete after 1s [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-prod-6mlJo8]
module.slack_signing_secret.aws_secretsmanager_secret_version.secretmanager_secret_version: Creating...
module.lambda.data.aws_iam_policy_document.lambda_secret_manager_policy_document: Reading...
module.lambda.data.aws_iam_policy_document.lambda_secret_manager_policy_document: Read complete after 0s [id=1851053628]
module.lambda.aws_iam_role_policy.lambda_secret_manager_policy: Modifying... [id=lambda-bot-prod-role:lambda-bot-prod-secret-manager-policy]
module.lambda.aws_iam_role_policy.lambda_secret_manager_policy: Modifications complete after 0s [id=lambda-bot-prod-role:lambda-bot-prod-secret-manager-policy]
module.slack_bot_token.aws_secretsmanager_secret_version.secretmanager_secret_version: Creation complete after 0s [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-prod-UoovR7|terraform-20250524091635592400000003]
module.slack_signing_secret.aws_secretsmanager_secret_version.secretmanager_secret_version: Creation complete after 0s [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-prod-6mlJo8|terraform-20250524091635604300000004]

Apply complete! Resources: 4 added, 1 changed, 0 destroyed.

Outputs:

api_gateway_invoke_url = "https://0pdgg6nqu1.execute-api.ap-northeast-1.amazonaws.com/"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":12,"Program":"tfcmt","SHA1":"1e398e8aed9b549fc9bdbd94f15a24b63f578ea3","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->